Application/services/shared/__tests__/artillery/test5/artilleryTest-5.yaml
config:
  target: 'http://localhost:4000'  
  phases:
    - duration: 60
      arrivalRate: 6        # Baseline load (5.7 rounded up)
      name: "Baseline load"
    - duration: 60
      arrivalRate: 10       # Midpoint between baseline and peak
      name: "Moderate load"
    - duration: 60
      arrivalRate: 14       # Peak load (13.7 rounded up)
      name: "Peak load"
    - duration: 60
      arrivalRate: 28       # 2x Peak load
      name: "Stress test 2x peak"
    - duration: 60
      arrivalRate: 42       # 3x Peak load
      name: "Stress test 3x peak"

scenarios:
  - flow:
      - get:
          url: "/api/storefront/media/readRecords?fields=%7B%7D&uniqueFlag=true"  
          headers:
            If-None-Match: ""